# RebarTrimExtendData Properties

---
The RebarTrimExtendData type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
RebarTrimExtendData Class
Autodesk.Revit.DB.Structure Namespace